# Create Pandas DataFrame

In [1]:
import pandas as pd

In [2]:
#Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.
# Create Empty DataFrame
df1 = pd.DataFrame()
print(df1)

Empty DataFrame
Columns: []
Index: []

In [3]:
#Creating a dataframe using List: DataFrame can be created using a single list or a list of lists.
lst1 = [1,2,3,4,5]
df2 = pd.DataFrame(lst1)
print(df2)

   0
0  1
1  2
2  3
3  4
4  5

In [4]:
# without print() function
df2

   0
0  1
1  2
2  3
3  4
4  5

In [5]:
# list of strings
lst2 = ['Geeks', 'For', 'Geeks', 'is', 
            'portal', 'for', 'Geeks']
 
# Calling DataFrame constructor on list
df3 = pd.DataFrame(lst2)
df3

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [6]:
#List of list

lst3 = [[1,2,3,4,5] , ['a' , 'b' , 'c' , 'd' , 'e'] , [6,7,8,9,10]]
df4 = pd.DataFrame(lst3)
df4

   0  1  2  3   4
0  1  2  3  4   5
1  a  b  c  d   e
2  6  7  8  9  10

In [7]:
# Define a dictionary containing employee data
dict1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
df5 = pd.DataFrame(dict1)
df5

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

In [8]:
#Dictionary and Series

dict_ser = { 'ID' : pd.Series([1,2,3]) ,
            'Name' : pd.Series(['a' , 'b' , 'c'])}
df6 = pd.DataFrame(dict_ser)
df6

   ID Name
0   1    a
1   2    b
2   3    c